import React from 'react';
import './Account.css';

function Account(props) {
  return (
    <div className="account">
      <h1>Tom Hanks</h1>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
      <p>Поведение this внутри стрелочной функции отличается от поведения
        this внутри обычной функции.Не имеет значения как она была вызвана,
        значение this внутри стрелочной функции всегда эквивалентно значения
        this внешней функции. Другими словами функция не создает собственный
        контекст исполнения, она использует внешний.В примере выше, myMethod()
      </p>
    </div>
  );
}

export default Account;
